name: "test_model"
backend: "pytorch"
max_batch_size: 0
input [
  {
    name: "x"
    data_type: TYPE_FP32
    dims:  [-1]
  }
]
output [
  {
    name: "result"
    data_type: TYPE_INT64
    dims:  [2]
  }
]
instance_group [
  { count: 1 }
]
parameters: [
  {
    key: "DISABLE_OPTIMIZED_EXECUTION"
    value: {
      string_value: "true"
    }
  },
  {
    key: "INFERENCE_MODE"
    value: {
      string_value: "true"
    }
  },
  {
    key: "ENABLE_NVFUSER"
    value: {
      string_value: "true"
    }
  },
  {
    key: "ENABLE_WEIGHT_SHARING"
    value: {
      string_value: "true"
    }
  }
]
